package HomeTaskOOP;

import java.io.BufferedReader;
import java.io.IOException;

/**
 * Created by UITS-Admin on 03.03.2019.
 */
public class Main {
    public static void main(String[] args) {
        /*
        Необходимо написать консольное приложение, в котором сначала нужно ввести значения
        свойств, для двух экземпляров людей (женщины и мужчины в произвольном порядке,
                возможны варианты ЖЖ, МЖ, ЖМ и ММ).
                Затем программа должна провести тест на совместимость и дать прогноз на результат
        отношений двух данных экземпляров. Алгоритм следующий:
        1. Метод “тест на совместимость” принимает два экземпляра людей и должен возвратить
        экземпляр человека или null.
        2. Вызвать метод “иметь отношения” первого экземпляра человека с аргументом - второй
        экземпляр.
        2 / 3
        3. Полученный результат вернуть как результат работы метода “тест на совместимость”.
*/

    }

}
